app/Controllers/Back/Pelamar.php

SELECT *
FROM `tbl_pelamar`
---
	public function ambildata()
	{
		if ($this->request->isAJAX()) {
			$data = [
				'tampildata' => $this->Pelamar->findAll()
			];

SELECT *
FROM `tbl_pelamar`
WHERE `tbl_pelamar`.`id_pelamar` = '3'
---
	public function formdetail()
	{
		if ($this->request->isAJAX()) {
			$id_pelamar = $this->request->getVar('id_pelamar');
			$row = $this->Pelamar->find($id_pelamar);