app/Models/Modeldatapelamar.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_pelamar`
---
	function count_filtered()
	{
		$this->_get_datatables_query();
		return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_pelamar`
---
	public function count_all()
	{
		$tbl_storage = $this->db->table($this->table);
		return $tbl_storage->countAllResults();